app/Models/CartModel.php

SELECT *
FROM `cart`
---
	public function listAll()
	{
		return $this->findAll();